package sounds

import "testing"

type TestData []string

func TestNew(t *testing.T) {
    var tests = []TestData {
        { "evlerimizdendirlermi", "эвлеримиздендирлерми", "e-v-l-e-r-i-m-i-z-d-e-n-d-i-r-l-e-r-m-i", "э-в-л-е-р-и-м-и-з-д-е-н-д-и-р-л-е-р-м-и" },
        { "yazıcılarımızğa", "языджыларымызгъа", "ya-z-ı-c-ı-l-a-r-ı-m-ı-z-ğ-a", "я-з-ы-дж-ы-л-а-р-ы-м-ы-з-гъ-а" },
        // { "", "", "", "" },

        // { "böyle", "бойле", "b-ö-y-l-e", "б-о-й-л-е" }, // м'яке
        // { "cümle", "джумле", "c-ü-m-l-e", "дж-у-м-л-е" }, // м'яке
        { "boldur", "болдур", "b-o-l-d-u-r", "б-о-л-д-у-р" }, // тверде
        { "tursat", "турсат", "t-u-r-s-a-t", "т-у-р-с-а-т" }, // тверде

        // { "yel", "ель", "ye-l-", "е-л-ь" },
        // { "el", "эль", "e-l-", "э-л-ь" },
        { "binaen", "бинаэн", "b-i-n-a-e-n", "б-и-н-а-э-н" },

        { "yekâne", "екяне", "ye-k-â-n-e", "е-к-я-н-е" },
        { "yekânedenlerniñ", "екянеденлернинъ", "ye-k-â-n-e-d-e-n-l-e-r-n-i-ñ", "е-к-я-н-е-д-е-н-л-е-р-н-и-нъ" },

        // { "söz", "сёз", "söz", "сёз" },
        // { "örnek", "орьнек", "örnek", "орьнек" },
        // { "özgün", "озьгюн", "özgün", "озьгюн" },
        // { "körmek", "корьмек", "körmek", "корьмек" },
        // { "böyle", "бойле", "böyle", "бойле" },
        // { "yol", "ёл", "yol", "ёл" },
        // { "yorğan", "ёргъан", "yorğan", "ёргъан" },
        // { "afyon", "афьён", "afyon", "афьён" },
        // { "yöneliş", "ёнелиш", "yöneliş", "ёнелиш" },
        // { "tüz", "тюз", "tüz", "тюз" },
        // { "sürmek", "сюрмек", "sürmek", "сюрмек" },
        // { "ürmet", "урьмет", "ürmet", "урьмет" },
        // { "üç", "учь", "üç", "учь" },
        // { "mümkün", "мумкюн", "mümkün", "мумкюн" },
        // { "kün", "кунь", "kün", "кунь" },
        // { "yutmaq", "ютмакъ", "yutmaq", "ютмакъ" },
        // { "yuqarı", "юкъары", "yuqarı", "юкъары" },
        // { "toyunda", "тоюнда", "toyunda", "тоюнда" },
        // { "qoyulmaq", "къоюлмакъ", "qoyulmaq", "къоюлмакъ" },
        // { "yüzüm", "юзюм", "yüzüm", "юзюм" },
        // { "yürmek", "юрьмек", "yürmek", "юрьмек" },
        // { "köyünde", "коюнде", "köyünde", "коюнде" },
        // { "tüyüm", "тююм", "tüyüm", "тююм" },
        { "yahşı", "яхшы", "ya-h-ş-ı", "я-х-ш-ы" },
        // { "Yağya", "Ягъя", "yağya", "ягъя" },
        { "qaya", "къая", "q-a-ya", "къ-а-я" },
        { "kâr", "кяр", "k-â-r", "к-я-р" },

        // виключення — тверде
        // { "tarih", "", "tarih", "" },
        // { "tarihta", "", "tarihta", "" },
        // { "tarihlar", "", "tarihlar", "" },
        // виключення — м'яке
        // { "teatr", "", "teatr", "" },
        // { "teatrde", "", "teatrde", "" },
        // { "teatrler", "", "teatrler", "" },

        // { "vaqıt", "", "vaqıt", "" }, // тверде
        // { "vaqıtta", "", "vaqıtta", "" },
        // { "vaqıtlar", "", "vaqıtlar", "" },
        // але зустрічаються
        // { "vaqıtte", "", "vaqıtte", "" },
        // { "vaqıtler", "", "vaqıtler", "" },

        // { "saat", "", "saat", "" }, // тверде
        // { "saatta", "", "saatta", "" },
        // { "saatlar", "", "saatlar", "" },
        // але зустрічаються
        // { "saatte", "", "saatte", "" },
        // { "saatler", "", "saatler", "" },

        // афікс -ki має тільки одну форму
        // { "Yaltadaki", "", "yaltadaki", "" },

        // "ъ" в складних словах в корінні
        // { "", "демиръёл", "", "демиръёл" },
        // { "yamyam", "ямъям", "ya-m--ya-m", "я-м-ъ-я-м" },

        // м'якість звуку л
        // { "sual", "суаль", "sual", "суаль" },
        // { "", "тиль", "", "тиль" },
        // { "", "сильмек", "", "сильмек" },
        // { "", "ольди", "", "ольди" },

        // роздільний знак в корінні після приголосних
        // { "dünya", "дюнья", "dünya", "дюнья" },
        // { "karyer", "карьер", "karyer", "карьер" },

        // у м'якому слові після твердого приголосного (ч, н, р, с, т, з) у першому твердому складі в корені
        // { "öz",     "озь",      "ö-z-",         "о-з-ь" },
        // { "kün",    "кунь",     "k-ü-n-",       "к-у-н-ь" },
        // { "yür",    "юрь",      "y-ü-r-",       "ю-р-ь" },
        // { "ürmet",  "урьмет",   "ü-r--m-e-t",   "у-р-ь-м-е-т" },
        // { "küç",    "кучь",     "k-ü-ç-",       "к-у-ч-ь" },
        // { "kün",    "кунь",     "k-ü-n-",       "к-у-н-ь" },
        // { "yür",    "юрь",      "y-ü-r-",       "ю-р-ь" },
        // { "köster", "косьтер",  "k-ö-s--t-e-r", "к-о-с-ь-т-е-р" },
        // { "köt",    "коть",     "k-ö-t-",       "к-о-т-ь" },
        // { "köz",    "козь",     "k-ö-z-",       "к-о-з-ь" },

        // виключення — м'яке ???
        // { "kök",    "кок",      "k-ö-k",        "к-о-к" },

        // { "aaa", "ааа", "a-a-a", "а-а-а" }, // Exception
        // { "bbb", "ббб", "b-b-b", "б-б-б" }, // Exception
        { "", "", "", "" }, // Ok
    }

    for _, test := range tests {
        test.crossAssert(t)
    }
}

func (test TestData) crossAssert(t *testing.T) {
    var matrix = []struct {
        sourceLang, targetLang string
        textIndex, wantIndex int
    }{
        { "crh",    "crh",    0, 2 },
        { "crh",    "crh_RU", 0, 3 },
        { "crh_RU", "crh",    1, 2 },
        { "crh_RU", "crh_RU", 1, 3 },
    }
    var sounds *Sounds

    for i, m := range matrix {
        if i == 0 || m.sourceLang != matrix[i - 1].sourceLang {
            sounds = New(&m.sourceLang, &test[m.textIndex])
        }

        got := *sounds.Trace(&m.targetLang)
        if got != test[m.wantIndex] {
            t.Errorf("New(%q, %q)[%q] == %q; want %q",
                m.sourceLang, test[m.textIndex], m.targetLang,
                got, test[m.wantIndex])
        }
    }
}
